LIBRARY({
    name: "LangFile",
    api: "CoreEngine",
    version: 1,
    shared: false
});

/**
 * Библиотека открыта для всех желающих создавать переводы при помощи отдельных файлов с удобным синтаксисом, поддерживающим комментарии, переменные и встраивания неограниченного количества переменных в строку.
 *
 * Я признателен вам за использование библиотеки и надеюсь, что вы понимаете: код открыт для ознакомления, однако копирование любой части недопустимо.
 *
 * Автор проекта: ArtemKot — github.com/ArtemKot4
 * Год основания: 2025
 * Вопросы можете задать в discord: discordapp.com/users/908847403073937419
 */