LIBRARY({
    name: "EffectBar",
    api: "CoreEngine",
    version: 1,
    shared: true
});

/**
 * Библиотека открыта для всех желающих создать уникальные эффекты с использованием интерфейсов. Поддерживает анимацию и готова помочь реализовать любые ваши идеи!
 *
 * Я признателен вам за использование библиотеки и надеюсь, что вы понимаете: код открыт для ознакомления, однако копирование любой части недопустимо.
 *
 * Автор проекта: ArtemKot — github.com/ArtemKot4
 * Год основания: 2025
 * Вопросы можете задать в discord: discordapp.com/users/908847403073937419
 */